Documents/УправлениеПриборамиУчета.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<Document>
		<Properties>
			<Name>УправлениеПриборамиУчета</Name>
			<BasedOn>
				<xr:Item>Catalog.ЛицевыеСчета</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.ПломбыПриборовУчета</xr:Item>
				<xr:Item>InformationRegister.УстановленныеПриборыУчета</xr:Item>
				<xr:Item>InformationRegister.ПоказанияПриборовУчета</xr:Item>
				<xr:Item>AccumulationRegister.ЗаменыПриборовУчета</xr:Item>
				<xr:Item>InformationRegister.ПоверкиПриборовУчета</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВидОперации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыОперацийУправленияПриборамиУчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбъектУстановки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЗданияИСооружения</v8:Type>
						<v8:Type>cfg:CatalogRef.ЛицевыеСчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Здание</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЗданияИСооружения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УказатьПломбыПриборовУчета</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбщедомовойСчетчик</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ПриборыУчета</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ПриборУчета</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ПриборыУчета</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидТарифа</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ВидыТарифов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаВключения</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаОтключения</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НачальноеПоказание</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>4</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КонечноеПоказание</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>4</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаПоследнейПоверки</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаСледующейПоверки</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СреднемесячноеПоказание</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>4</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидПломбы</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыПломбПриборовУчета</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СерийныйНомерПломбы</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидПломбыНовый</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыПломбПриборовУчета</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СерийныйНомерПломбыНовый</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТипПрибора</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>МестоРазмещения</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>25</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

InformationRegisters/УстановленныеПриборыУчета.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<InformationRegister>
		<Properties>
			<Name>УстановленныеПриборыУчета</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Действует</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СреднемесячноеПоказание</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>МестоРазмещения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипПрибора</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаСледующейПоверки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПоследнейПоверки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ОбъектУстановки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЗданияИСооружения</v8:Type>
						<v8:Type>cfg:CatalogRef.ЛицевыеСчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПриборУчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПриборыУчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ПломбыПриборовУчета.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<InformationRegister>
		<Properties>
			<Name>ПломбыПриборовУчета</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Действует</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Здание</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЗданияИСооружения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЛицевойСчет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛицевыеСчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПриборУчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПриборыУчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидПломбы</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыПломбПриборовУчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СерийныйНомер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/ВидыОперацийУправленияПриборамиУчета.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<Enum>
		<Properties>
			<Name>ВидыОперацийУправленияПриборамиУчета</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>УстановкаПрибораУчета</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтключениеПрибораУчета</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтключениеНаПоверку</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВключениеПослеПоверки</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗаменаПломбы</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ТарифностьСчетчиков.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<Enum>
		<Properties>
			<Name>ТарифностьСчетчиков</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Однотарифный</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Двухтарифный</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Трехтарифный</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/ПриборыУчета.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<Catalog>
		<Properties>
			<Name>ПриборыУчета</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Услуга</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Услуги</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗаводскойНомер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Тарифность</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТарифностьСчетчиков</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпособРегистрацииПоказаний</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СпособыРегистрацииПоказанийСчетчиков</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Коэффициент</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>6</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЕдиницаИзмерения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КлассификаторЕдиницИзмерения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Разрядность</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Идентификатор</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>16</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбщедомовойСчетчик</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Здание</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЗданияИСооружения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВРО</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВКО</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЛицевойСчет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛицевыеСчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Documents/УправлениеПриборамиУчета/Forms/ФормаДокумента/Ext/Form/Module.bsl
////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ОБЩЕГО НАЗНАЧЕНИЯ

// Процедура устанавливает видимость и доступность элементов формы.
//
// Параметры:
//  Нет.
//
&НаСервере
Процедура УстановитьВидимостьИДоступность()
	
	Если Объект.ВидОперации = Перечисления.ВидыОперацийУправленияПриборамиУчета.УстановкаПрибораУчета Тогда
		
		Элементы.ПриборыУчетаДатаВключения.Видимость = Истина;
		Элементы.ПриборыУчетаДатаОтключения.Видимость = Ложь;
		Элементы.ПриборыУчетаДатаСледующейПоверки.Видимость = Истина;
		Элементы.ПриборыУчетаДатаПоследнейПоверки.Видимость = Истина;
		Элементы.ПриборыУчетаНачальноеПоказание.Видимость = Истина;
		Элементы.ПриборыУчетаКонечноеПоказание.Видимость = Ложь;
		Элементы.ПриборыУчетаСреднемесячноеПоказание.Видимость = Ложь;
		Элементы.УказатьПломбыПриборовУчета.Видимость = Истина;
		Элементы.ПриборыУчетаВидТарифа.Видимость = Истина;
		Элементы.ПриборыУчетаВидПломбыНовый.Видимость = Ложь;
		Элементы.ПриборыУчетаСерийныйНомерПломбыНовый.Видимость = Ложь;
		
	ИначеЕсли Объект.ВидОперации = Перечисления.ВидыОперацийУправленияПриборамиУчета.ОтключениеПрибораУчета Тогда
		
		Элементы.ПриборыУчетаДатаВключения.Видимость = Ложь;
		Элементы.ПриборыУчетаДатаОтключения.Видимость = Истина;
		Элементы.ПриборыУчетаДатаСледующейПоверки.Видимость = Ложь;
		Элементы.ПриборыУчетаДатаПоследнейПоверки.Видимость = Ложь;
		Элементы.ПриборыУчетаНачальноеПоказание.Видимость = Ложь;
		Элементы.ПриборыУчетаКонечноеПоказание.Видимость = Истина;
		Элементы.ПриборыУчетаСреднемесячноеПоказание.Видимость = Ложь;
		Элементы.УказатьПломбыПриборовУчета.Видимость = Истина;
		Элементы.ПриборыУчетаВидТарифа.Видимость = Истина;
		Элементы.ПриборыУчетаВидПломбыНовый.Видимость = Ложь;
		Элементы.ПриборыУчетаСерийныйНомерПломбыНовый.Видимость = Ложь;
		

	ИначеЕсли Объект.ВидОперации = Перечисления.ВидыОперацийУправленияПриборамиУчета.ОтключениеНаПоверку Тогда
		
		Элементы.ПриборыУчетаДатаВключения.Видимость = Ложь;
		Элементы.ПриборыУчетаДатаОтключения.Видимость = Истина;
		Элементы.ПриборыУчетаДатаСледующейПоверки.Видимость = Ложь;
		Элементы.ПриборыУчетаДатаПоследнейПоверки.Видимость = Ложь;
		Элементы.ПриборыУчетаНачальноеПоказание.Видимость = Ложь;
		Элементы.ПриборыУчетаКонечноеПоказание.Видимость = Истина;
		Элементы.ПриборыУчетаСреднемесячноеПоказание.Видимость = Истина;
		Элементы.УказатьПломбыПриборовУчета.Видимость = Истина;
		Элементы.ПриборыУчетаВидТарифа.Видимость = Истина;
		Элементы.ПриборыУчетаВидПломбыНовый.Видимость = Ложь;
		Элементы.ПриборыУчетаСерийныйНомерПломбыНовый.Видимость = Ложь;
		

	ИначеЕсли Объект.ВидОперации = Перечисления.ВидыОперацийУправленияПриборамиУчета.ВключениеПослеПоверки Тогда
		
		Элементы.ПриборыУчетаДатаВключения.Видимость = Истина;
		Элементы.ПриборыУчетаДатаОтключения.Видимость = Ложь;
		Элементы.ПриборыУчетаДатаСледующейПоверки.Видимость = Истина;
		Элементы.ПриборыУчетаДатаПоследнейПоверки.Видимость = Истина;
		Элементы.ПриборыУчетаНачальноеПоказание.Видимость = Истина;
		Элементы.ПриборыУчетаКонечноеПоказание.Видимость = Ложь;
		Элементы.ПриборыУчетаСреднемесячноеПоказание.Видимость = Ложь;
		Элементы.УказатьПломбыПриборовУчета.Видимость = Истина;
		Элементы.ПриборыУчетаВидТарифа.Видимость = Истина;
		Элементы.ПриборыУчетаВидПломбыНовый.Видимость = Ложь;
		Элементы.ПриборыУчетаСерийныйНомерПломбыНовый.Видимость = Ложь;
		

	ИначеЕсли Объект.ВидОперации = Перечисления.ВидыОперацийУправленияПриборамиУчета.ЗаменаПломбы Тогда
		
		Элементы.ПриборыУчетаДатаВключения.Видимость = Ложь;
		Элементы.ПриборыУчетаДатаОтключения.Видимость = Ложь;
		Элементы.ПриборыУчетаДатаСледующейПоверки.Видимость = Ложь;
		Элементы.ПриборыУчетаДатаПоследнейПоверки.Видимость = Ложь;
		Элементы.ПриборыУчетаНачальноеПоказание.Видимость = Ложь;
		Элементы.ПриборыУчетаКонечноеПоказание.Видимость = Ложь;
		Элементы.ПриборыУчетаСреднемесячноеПоказание.Видимость = Ложь;
		Элементы.УказатьПломбыПриборовУчета.Видимость = Ложь;
		Элементы.ПриборыУчетаВидПломбы.Видимость = Истина;
		Элементы.ПриборыУчетаСерийныйНомерПломбы.Видимость = Истина;
		Элементы.ПриборыУчетаВидПломбыНовый.Видимость = Истина;
		Элементы.ПриборыУчетаСерийныйНомерПломбыНовый.Видимость = Истина;
		Элементы.ПриборыУчетаВидТарифа.Видимость = Ложь;
		
	КонецЕсли;
	
	ЕСЛИ Объект.ВидОперации <> Перечисления.ВидыОперацийУправленияПриборамиУчета.ЗаменаПломбы Тогда 
		Если Объект.УказатьПломбыПриборовУчета Тогда
			Элементы.ПриборыУчетаВидПломбы.Видимость = Истина;
			Элементы.ПриборыУчетаСерийныйНомерПломбы.Видимость = Истина;
		Иначе
			Элементы.ПриборыУчетаВидПломбы.Видимость = Ложь;
			Элементы.ПриборыУчетаСерийныйНомерПломбы.Видимость = Ложь;
		КонецЕсли;
	КонецЕсли;	

	
КонецПроцедуры // УстановитьВидимостьИДоступность()

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

// Процедура - обработчик события ПриСозданииНаСервере.
//
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ОСМДСервер.ЗаполнитьШапкуДокумента(
		Объект,
		,
		Параметры.ЗначениеКопирования,
		Параметры.Основание,
		СостояниеДокумента,
		КартинкаСостоянияДокумента,
		РазрешеноПроведение,
		ПоследнееИзменение,
		Параметры.ЗначенияЗаполнения);
	
	УстановитьВидимостьИДоступность();	
	
 	// ДополнительныеОтчетыИОбработки
	ДополнительныеОтчетыИОбработки.ПриСозданииНаСервере(ЭтаФорма);
	// Конец ДополнительныеОтчетыИОбработки

	Локализация.ПриСозданииНаСервере(ЭтаФорма, Объект.Ссылка);
	
КонецПроцедуры

// Процедура - обработчик события ПослеЗаписи.
//
&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	ОСМДКлиент.ОбновитьСостояниеДокумента(Объект, СостояниеДокумента, КартинкаСостоянияДокумента, РазрешеноПроведение, ПоследнееИзменение);
	Оповестить("ИзмененЛицевойСчет", Объект.ОбъектУстановки , ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбъектУстановкиНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ПараметрыВыбораЗначения = Новый Структура;
	ПараметрыВыбораЗначения.Вставить("ОтборОрганизация",	Объект.Организация);
	ПараметрыВыбораЗначения.Вставить("ОтборЗдание",			Объект.Здание);

	ОткрытьФорму("Справочник.ЛицевыеСчета.Форма.ФормаВыбораСОтбором", ПараметрыВыбораЗначения, Элемент);
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПриборУчетаУстановлен(ПриборУчета)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	УстановленныеПриборыУчетаСрезПоследних.ПриборУчета
		|ИЗ
		|	РегистрСведений.УстановленныеПриборыУчета.СрезПоследних КАК УстановленныеПриборыУчетаСрезПоследних
		|ГДЕ
		|	УстановленныеПриборыУчетаСрезПоследних.Действует = ИСТИНА
		|	И УстановленныеПриборыУчетаСрезПоследних.ПриборУчета = &ПриборУчета";
		
		
	Запрос.УстановитьПараметр("ПриборУчета", ПриборУчета);
	
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		Возврат Ложь;
	Иначе
		Возврат Истина;
	КонецЕсли;

КонецФункции

&НаКлиенте
Процедура ПриборыУчетаПриборУчетаОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	Если Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийУправленияПриборамиУчета.УстановкаПрибораУчета") Тогда
	
		Если ПриборУчетаУстановлен(ВыбранноеЗначение) Тогда
			
			НСтрока = НСтр("ru='Прибор учета уже установлен';uk='Прилад обліку вже встановлений'");
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтрока,, "Объект.ПриборыУчета.ПриборУчета");
			
			СтандартнаяОбработка = Ложь;
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриборыУчетаПриборУчетаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("ОбъектУстановки",		Объект.ОбъектУстановки);
	СтруктураПараметров.Вставить("ВидОперации",			Объект.ВидОперации);
	СтруктураПараметров.Вставить("ДатаУстановки",		Объект.Дата);
	
	Если Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийУправленияПриборамиУчета.УстановкаПрибораУчета") Тогда
		ОткрытьФорму("Справочник.ПриборыУчета.Форма.ФормаВыбораНеустановленных", СтруктураПараметров, Элемент);
	Иначе	
		ОткрытьФорму("Справочник.ПриборыУчета.ФормаВыбора", СтруктураПараметров, Элемент);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВидОперацииПриИзменении(Элемент)
	
	УстановитьВидимостьИДоступность();
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьДанныеЛицевойСчетПриИзменении(ЛицевойСчет)
	
	СтруктураДанные = Новый Структура;
	
	СтруктураДанные.Вставить("Организация", ЛицевойСчет.Владелец.Организация);
	СтруктураДанные.Вставить("Здание", ЛицевойСчет.Владелец);

	
	Если НЕ ЗначениеЗаполнено(ЛицевойСчет) Тогда
		
		СтруктураДанные.Вставить("ОтветственныйВладелец", Справочники.ПотребителиУслуг.ПустаяСсылка());
		
		Возврат СтруктураДанные;
		
	КонецЕсли;
	
	ТаблицаОтветственныйВладелец = РегистрыСведений.ОтветственныйВладелецЛицевогоСчета.СрезПоследних(ТекущаяДата(), Новый Структура("ЛицевойСчет", ЛицевойСчет));
	
	Если ТаблицаОтветственныйВладелец.Количество() > 0 Тогда
		СтруктураДанные.Вставить("ОтветственныйВладелец", ТаблицаОтветственныйВладелец[0].ОтветственныйВладелец);
	Иначе
		СтруктураДанные.Вставить("ОтветственныйВладелец", Справочники.ПотребителиУслуг.ПустаяСсылка());
	КонецЕсли;
	
	Возврат СтруктураДанные;
	
КонецФункции // ПолучитьДанныеЛицевойСчетПриИзменении()

&НаКлиенте
Процедура ОбъектУстановкиПриИзменении(Элемент)
	
	СтруктураДанные = ПолучитьДанныеЛицевойСчетПриИзменении(Объект.ОбъектУстановки);
	
	Объект.Организация = СтруктураДанные.Организация;
	Объект.Здание = СтруктураДанные.Здание;
	ОтветственныйВладелецПред = СтруктураДанные.ОтветственныйВладелец;
	
КонецПроцедуры


&НаКлиенте
Процедура ПриборыУчетаСреднемесячноеПоказаниеНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Строка = Элементы.ПриборыУчета.ТекущиеДанные;
	
	Поле = Элементы.ПриборыУчета.ТекущаяСтрока;
	Если НЕ ЗначениеЗаполнено(Строка.ДатаОтключения) Тогда
		Индекс = Число(Строка.НомерСтроки - 1);
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Не заполнена дата отключения";
		Сообщение.Поле = "Объект.ПриборыУчета["+Индекс+"].ДатаОтключения";
		Сообщение.Сообщить();
		
	Иначе
		
		ПараметрыЗаполнения = Новый Структура;
		ПараметрыЗаполнения.Вставить("ДатаДокумента",Строка.ДатаОтключения);
		ПараметрыЗаполнения.Вставить("ПриборУчета",Строка.ПриборУчета);
		ПараметрыЗаполнения.Вставить("ЛицевойСчет",Объект.ОбъектУстановки);
		Если НЕ ЗначениеЗаполнено(Строка.ВидТарифа) Тогда
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = НСтр("ru = 'Не  заполнено поле ""вид тарифа""'; uk = 'Не заповнено поле ""вид тарифу""'");
			Сообщение.Поле = "Объект.ПриборыУчета["+Индекс+"].ВидТарифа";
			Сообщение.Сообщить();
			Возврат;
		КонецЕсли;	
		ПараметрыЗаполнения.Вставить("ВидТарифа",Строка.ВидТарифа);

		
		АдресВременногоХранилища = ОткрытьФормуМодально("Документ.УправлениеПриборамиУчета.Форма.ФормаРасчетаСредней",ПараметрыЗаполнения);
		
		Если ЗначениеЗаполнено(АдресВременногоХранилища) Тогда
			
			Строка.СреднемесячноеПоказание = ПолучитьИзВременногоХранилища(АдресВременногоХранилища);
			
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры


&НаКлиенте
Процедура ОсновнаяПриборУчетаПриИзменении(Элемент)
	
	ТекущийПУ = Элементы.ПриборыУчета.ТекущиеДанные.ПриборУчета;
	
	ОсновнаяПриборУчетаПриИзмененииНаСервере(ТекущийПУ);
	
	СтруктураПломбы = ПоказатьПломбыПрибораУчета(ТекущийПУ);
	
	Если  ТипЗнч(СтруктураПломбы) = Тип("Структура") Тогда
		Текущаястрока = Элементы.ПриборыУчета.ТекущиеДанные;
		Текущаястрока.ВидПломбы = СтруктураПломбы.ВидПломбы;
		Текущаястрока.СерийныйНомерПломбы = СтруктураПломбы.СерийныйНомер;
	КонецЕсли;
	
		
КонецПроцедуры

&НаСервере
Функция ОсновнаяПриборУчетаПриИзмененииНаСервере(ТекущийПУ)
	
	Если Объект.ВидОперации <> Перечисления.ВидыОперацийУправленияПриборамиУчета.ЗаменаПломбы Тогда
		Если ТекущийПУ.Тарифность =  Перечисления.ТарифностьСчетчиков.Однотарифный Тогда
			ОчиститьИУстановить(1,ТекущийПУ);
		ИначеЕсли 	ТекущийПУ.Тарифность =  Перечисления.ТарифностьСчетчиков.Двухтарифный Тогда
			ОчиститьИУстановить(2,ТекущийПУ);
		Иначе	
			ОчиститьИУстановить(3,ТекущийПУ);
		КонецЕсли;
	КонецЕсли;	
	
КонецФункции

// <Описание процедуры>
//
// Параметры
//  <Параметр1>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//  <Параметр2>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//
&НаСервере
Функция  ПоказатьПломбыПрибораУчета(ПриборУчета)

	 Запрос = Новый Запрос;
	 ЗАпрос.УстановитьПараметр("ПриборУчета",ПриборУчета);
	 ЗАпрос.УстановитьПараметр("Дата",КонецДня(Объект.Дата));
	 Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	                |	ПломбыПриборовУчетаСрезПоследних.ПриборУчета,
	                |	ПломбыПриборовУчетаСрезПоследних.ВидПломбы,
	                |	ПломбыПриборовУчетаСрезПоследних.СерийныйНомер
	                |ИЗ
	                |	РегистрСведений.ПломбыПриборовУчета.СрезПоследних(&Дата, ПриборУчета = &ПриборУчета) КАК ПломбыПриборовУчетаСрезПоследних
	                |ГДЕ
	                |	ПломбыПриборовУчетаСрезПоследних.Действует = ИСТИНА";
	Результат = Запрос.Выполнить();
	Если Не Результат.Пустой() Тогда
		СтруктураПломбы = Новый Структура();
		СтруктураПломбы.Вставить("ВидПломбы");
		СтруктураПломбы.Вставить("СерийныйНомер");
		Выборка = Результат.Выбрать();
		Выборка.Следующий();
		ЗаполнитьЗначенияСвойств(СтруктураПломбы,Выборка);
		Возврат СтруктураПломбы;
	Иначе
		Возврат Ложь
	КонецЕсли;
	

КонецФункции // ПоказатьПломбыПрибораУчета()


&НаСервере
Процедура ОчиститьИУстановить(Число,ПУ)

	Сч = Число - 1;
	
	Пока Сч <> 0 Цикл  
		НоваяСтрока = Объект.ПриборыУчета.Добавить();
		НоваяСтрока.ПриборУчета = ПУ;
		Сч = Сч -1;
	КонецЦикла;	

КонецПроцедуры // ОчиститьИУстановить(2);ОчиститьИУстановить()

&НаКлиенте
Процедура УказатьПломбыПриборовУчетаПриИзменении(Элемент)
	УстановитьВидимостьИДоступность();
КонецПроцедуры

&НаКлиенте
Процедура ПриборыУчетаДатаПоследнейПоверкиПриИзменении(Элемент)
	ТекСтрока = Элементы.ПриборыУчета.ТекущиеДанные;
	ТекСтрока.ДатаСледующейПоверки = ДобавитьМесяц(ТекСтрока.ДатаПоследнейПоверки, 48); 
КонецПроцедуры

&НаКлиенте
Процедура ОбщедомовойСчетчикПриИзменении(Элемент)
	Если Объект.ОбщедомовойСчетчик = Истина Тогда
		Элементы.ОбъектУстановки.Видимость = Ложь;
	Иначе
		Элементы.ОбъектУстановки.Видимость = Истина;
	КонецЕсли;
КонецПроцедуры
